{
  "name": "Akshat Jangid",
  "bio": "I am a passionate and goal-driven Data Science and AI enthusiast with a strong foundation in data analysis, machine learning, and model deployment. My journey has been shaped by hands-on experience in building intelligent systems that solve real-world problems. I am deeply interested in extracting meaningful insights from data and transforming them into actionable solutions that add value to business and society.",
  "skills": [
    "Python",
    "NumPy",
    "Pandas",
    "Matplotlib",
    "Seaborn",
    "Scikit-learn",
    "TensorFlow",
    "Keras",
    "OpenCV",
    "Streamlit",
    "Git & GitHub",
    "VS Code",
    "Jupyter Notebook",
    "Flask"
  ],
  "learning": [
    "Deep Learning (ANNs,CNNs, RNNs, Transformers)",
    "LangChain & Generative AI",
    "Reinforcement Learning",
    "Model Deployment (Streamlit, Flask, FastAPI)",
    "Data Engineering (SQL, Airflow basics)",
    "Cloud platforms (AWS, GCP basics)"
  ],
  "projects": [
    {
      "title": "AgriSmart : AI Partner for every farmer",
      "description": "Developed a web application that recommends suitable crops based on soil and weather data using a Random Forest model, and detects plant leaf diseases via a CNN-based deep learning model with treatment suggestions in English and Hindi. Deployed on Render with optimized model loading and performance handling.",
      "github": "https://github.com/Akshatjangid/AgriSmart",
      "app link": "https://agrismart-k05z.onrender.com/"
    },{
      "title": "Customer Satisfaction Prediction",
      "description": "Built a logistic regression model to predict airline passenger satisfaction using survey data. Implemented feature engineering, preprocessing, model evaluation, and deployed using Streamlit.",
      "github": "https://github.com/Akshatjangid/customer-satisfaction-app",
      "app link": "https://customer-satisfaction-app.onrender.com"
    },
    {
      "title": "Personal Portfolio Website",
      "description": "Developed a responsive personal portfolio using Streamlit. Features include multi-page navigation, project showcase, resume download, and contact form — all dynamically managed via JSON.",
      "github": "https://github.com/Akshatjangid/portfolio_streamlit",
      "app link": "https://portfolio-akshatjangid.streamlit.app/"
    },
    {
      "title": "bike price Prediction ",
      "description": "Currently building a robust ML model for long-term stock price forecasting using regression and time series analysis. Focused on improving data preprocessing and prediction accuracy.",
      "github": "https://github.com/Akshatjangid/bike_price_prediction",
      "app link": "https://bike-price-prediction-jkhd.onrender.com/"
    },
    {
      "title": "Stock Price Prediction (In Progress)",
      "description": "A simple Streamlit app to predict bike prices based on features like brand, model, year, and condition.",
      "github": "https://github.com/Akshatjangid/Stock_Price_Predictor",
      "app link": ""
    }
  ],
  "goals": "To become a skilled Data Scientist capable of designing and deploying impactful machine learning models for real-world business and social challenges. I aim to keep learning cutting-edge tools, stay updated with AI trends, and contribute to innovative projects with passion and purpose."
}
